Repository: majorsilence/My-FyiReporting
Catalog: RdlMapFile/Resources/Strings.*.resx
Languages: ru_ru

# DesignXmlDraw_SetMapFile_ErrorOpeningFile
source: Error Opening File
ru_ru: Ошибка открытия файла

# DesignXmlDraw_SetMapFile_Unable_to_open_file
source: Unable to open file
ru_ru: Не удалётся отрыть файл

# MapFile_helpHelpToolStripMenuItem_Click_Help_URL_Invalid
source: Help URL Invalid
ru_ru: Некорректная ссылка на помощь

# MapFile_openToolStripMenuItem_Click_ErrorOpening
source: Error opening
ru_ru: Ошибка открытия

# MapFile_reducePolygonPointsToolStripMenuItem_Click_Reduce_Polygon_Count
source: Reduce Polygon Count
ru_ru: Уменьшение количества сторон многоугольника

# MapFile_reducePolygonPointsToolStripMenuItem_ReducePolygon
source: Polygon point count reduced by
ru_ru: Количество сторок многоугольника уменьшено на

# MapFile_ShowB_RdlMapFileDesigner
source: RdlMapFile designer
ru_ru: Дизайнер карт

# MapFile_ShowB_Untitled
source: untitled
ru_ru: безымянный

# MapFile_ShowB_WantSave
source: Do you want to save changes you made to '{0}'?
ru_ru: Хотите сохранить изменения сделанные в '{0}'?

# MapFile_supportToolStripMenuItem_Click_Support_URL_Invalid
source: Support URL Invalid
ru_ru: Некорректная ссылка на поддержку

# DialogAbout_About
source: Map File Designer creates XML files that can be used in map Charts within the RDL designer. Copyright (C) 2004-2008 fyiReporting Software, LLC Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. For additional information, email info@fyireporting.com or visit the website www.fyiReporting.com.
ru_ru: Дизайнер карт создает XML файлы, которые можно использовать в диаграммах редактора отчёта. Copyright (C) 2004-2008 fyiReporting Software, LLC Под лицензией Apache, версии 2.0 (the "License"); Вы не можете использовать этот файл только в соответствии с лицензией. Вы можете получить копию лицензии на http://www.apache.org/licenses/LICENSE-2.0 Если иное не требуется законодательством или согласовано в письменной форме, программное обеспечение распространяется под лицензия КАК ЕСТЬ", БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА, явных или подразумеваемых. См. Лицензию на других языках, регулирующих разрешения и ограничения в рамках лицензии. Для получения дополнительной информации, напишите на info@fyireporting.com или посетите сайт www.fyiReporting.com.

# DialogAbout_Version
source: Version {0}
ru_ru: Версия {0}

# MapFile_editToolStripMenuItem_DropDownOpening_Undo
source: Undo
ru_ru: Отменить

# MapFile_SetTitle_fyiReporting_MapFile_Designer
source: fyiReporting MapFile Designer
ru_ru: Редактор карт

# MapFile_SetTitle_untitled
source: untitled
ru_ru: безымянный

# DesignXmlDraw_Undo_Delete
source: Delete
ru_ru: удаление

# DesignXmlDraw_Undo_InsertLinePoint
source: Insert Line Point
ru_ru: вставку точки линии

# DesignXmlDraw_Undo_InsertPolygonPoint
source: Insert Polygon Point
ru_ru: вставку вершины многоугольника

# DesignXmlDraw_Undo_InsertText
source: Insert Text
ru_ru: вставку текста

# DesignXmlDraw_Undo_Move
source: Move
ru_ru: перемещение

# DesignXmlDraw_Undo_Paste
source: Paste
ru_ru: вставку из буфера

# DesignXmlDraw_Undo_ReducePointCount
source: Reduce Point Count
ru_ru: уменьшение количества вершин

# DesignXmlDraw_Undo_Resize
source: Resize
ru_ru: изменение размера

# NodeChangedUndo_Undo_change
source: change
ru_ru: изменение

# NodeInsertedUndo_Undo_insert
source: insert
ru_ru: вставку

# NodeRemovedUndo_Undo_remove
source: remove
ru_ru: удаление

# PropertyBase_Undo_change
source: change
ru_ru: изменение

# PropertyText_Undo_FontChange
source: Font change
ru_ru: изменение шрифта

# DesignXmlDraw_Error_XMLNotMapData
source: The MapData XML file doesn't contain the 'MapData' element
ru_ru: XML карты не содержит элемент 'MapData'.

# Undo_Error_EndGroupNotMatchStartGroup
source: Internal logic error: EndGroup doesn't match StartGroup
ru_ru: Внутренняя логическая ошибка: конец группы не соответствует началу группы

# Undo_Error_UnknownAction
source: Unknown Action
ru_ru: Неизвестное действие

# ShapeFile_ErrorA_InvalidFileCode
source: Invalid FileCode encountered. Expecting {0}.
ru_ru: Некорректный код файла. Ожидается {0}.

# ShapeFile_ErrorA_ShapeTypeNotSupported
source: ShapeType {0} is not supported.
ru_ru: Тип фигуры {0} не поддерживается.
