Repository: majorsilence/My-FyiReporting
Catalog: RdlEngine/Resources/Strings.*.resx
Languages: ru_ru

# CharReader_Error_FileReaderUnGetFirstChar
source: error : FileReader.UnGet : ungetted first char
ru_ru: ошибка : не найден первый символ

# ChartLayout_Error_PlotAreaHeightIs0
source: Plot area height is less than or equal to 0
ru_ru: Высота участка меньше или равна 0

# ChartLayout_Error_PlotAreaWidthIs0
source: Plot area width is less than or equal to 0
ru_ru: Ширина участка меньше или равна 0

# DataSourceDefn_Error_NoPasswordForDSR
source: No password provided for shared DataSource reference
ru_ru: Для общего источника данных не задан пароль

# Filter_Error_TopNAndBottomNRequireInt
source: Filter operators TopN and BottomN require an integer value got {0}.
ru_ru: Операторы фильтра TopN и BottomN требуют целое значение {0}.

# Financial_Error_IPmtNotSupportPayments
source: IPmt doesn't support payments due at beginning of period.
ru_ru: IPmt не поддерживает выплаты, причитающиеся на начало периода.

# FunctionCode_Error_MethodNotFound
source: {0} method not found in code
ru_ru: Метод "{0}" не найден в коде

# FunctionCustomInstance_Error_MethodNotFoundInClass
source: {0} method not found in class {1}
ru_ru: Метод "{0}" не найден в классе "{1}"

# FunctionCustomStatic_Error_MethodNotFoundInClass
source: {0} method not found in class {1}
ru_ru: Метод "{0}" не найден в классе "{1}"

# FunctionFieldCollection_Error_FieldCollectionInvalid
source: Field collection argument {0} is invalid
ru_ru: Аргумент "{0}" недопустил для коллекции Field

# FunctionFieldCollection_Error_FieldCollectionNull
source: Field collection argument is null
ru_ru: Аргумент коллекции Field пуст

# FunctionGlobalCollection_Error_GlobalsNull
source: Globals collection argument is null
ru_ru: Аргумент коллекции Globals пуст

# FunctionGlobalCollection_Error_GlobalsUnknown
source: Globals collection argument '{0}' is unknown.
ru_ru: Аргумент "{0}" недопустил для коллекции Globals

# FunctionParameterCollection_Error_ParameterCollectionInvalid
source: Parameter collection argument {0} is invalid
ru_ru: Аргумент "{0}" недопустил для коллекции Parameter

# FunctionParameterCollection_Error_ParameterCollectionNull
source: Parameter collection argument is null
ru_ru: Аргумент коллекции Parameter пуст

# FunctionReportItemCollection_Error_ReportItemCollectionInvalid
source: ReportItem collection argument {0} is invalid
ru_ru: Аргумент "{0}" недопустил для коллекции ReportItem

# FunctionReportItemCollection_Error_ReportItemCollectionNull
source: ReportItem collection argument is null
ru_ru: Аргумент коллекции ReportItem пуст

# FunctionReportParameter_Error_UnknownReporParameterMethod
source: Internal error: unknown Report Parameter method
ru_ru: Внутренняя ошибка: неизвестный метод Report Parameter

# FunctionSystem_Error_MethodNotFound
source: {0} method not found in class {1}
ru_ru: Метод "{0}" не найден в классе "{1}"

# FunctionUserCollection_Error_UserCollectionInvalid
source: User collection argument {0} is invalid.
ru_ru: Аргумент "{0}" недопустил для коллекции User

# FunctionUserCollection_Error_UserCollectionNull
source: User collection argument is null
ru_ru: Аргумент коллекции User пуст

# FunctionUserLanguage_Error_ConvertToBoolean
source: Invalid conversion from Language to boolean.
ru_ru: Недопустимый перевод из языка к Boolean.

# FunctionUserLanguage_Error_ConvertToDateTime
source: Invalid conversion from Language to DateTime.
ru_ru: Недопустимый перевод из языка к DateTime.

# FunctionUserLanguage_Error_ConvertToDecimal
source: Invalid conversion from Language to Decimal.
ru_ru: Недопустимый перевод из языка к Decimal.

# FunctionUserLanguage_Error_ConvertToDouble
source: Invalid conversion from Language to double.
ru_ru: Недопустимый перевод из языка к Double.

# FunctionUserLanguage_Error_ConvertToInt32
source: Invalid conversion from Language to Int32.
ru_ru: Недопустимый перевод из языка к Int32.

# MhtBuilder_Error_Extension
source: The extension of the filename provided + '{0}', does not have the expected extension(s) '{1}'
ru_ru: Расширение имени файла '{0}' не имеет подходящего расширения из '{1}'

# MhtBuilder_Error_FilenameNoExtension
source: The filename provided, '{0}', has no extension. If are specifying a folder, make sure it ends in a trailing slash. The expected file extension(s) are '{1}'
ru_ru: Название файла '{0}' не имеет расширения. Если указываете папку, убедитесь, что она заканчивается косой чертой. Ожидаемые расширения файлов являются '{1}'

# MhtWebFile_Error_ConvertOnlyHTMLOrCSS
source: Converting references only makes sense for HTML or CSS files; this file is of type '{0}'
ru_ru: Преобразование ссылок имеет смысл только для HTML или CSS-файлов; этот файл имеет тип '{0}'

# MhtWebFile_Error_NoFilename
source: No filename was provided, and the HTML title tag was not found, so a filename could not be automatically generated. You'll need to provide a filename and not a folder.
ru_ru: Имя файла не указано и HTML тег заголовка не найден, поэтому имя файла не может быть вычислено автоматически. Вы должны указать имя файла, а не папки.

# OneFileStreamGen_Error_FileAlreadyExists
source: File {0} already exists.
ru_ru: Файл {0} уже существует.

# Pages_Error_CurrentPageMustInList
source: CurrentPage must be in the list of pages
ru_ru: Текущая страница должна быть в списке страниц.

# PageTextHtml_Error_BuildMethodMustCalledPriorTotalHeight
source: Build method must be called prior to referencing TotalHeight.
ru_ru: Метод Build должен быть вызван до обращения к свойству TotalHeight.

# PdfOutline_Error_GetObjectNumberMustBeforeGetOutlineDict
source: GetObjectNumber must be called before GetOutlineDict
ru_ru: GetObjectNumber должен вызываться до GetOutlineDict

# ProcessReport_Error_ReportHasErrors
source: Report has errors. Cannot be processed.
ru_ru: Отчёт имеет ошибки и не может быть обработан.

# Query_Error_XMLMustContainTopLevelRows
source: Error: XML Data must contain top level rows.
ru_ru: Ошибка: XML-данные должны содержать строки верхнего уровня.

# RdlEngineConfig_Error_CashModuleNotFound
source: {0} could not be found
ru_ru: Не удалось найти модуль {0}

# RdlEngineConfig_Error_CodeModuleNotLoaded
source: {0} could not be loaded
ru_ru: Не удалось загрузить модуль {0}

# RdlEngineConfig_Error_NotKnownCustomReportItemType
source: {0} is not a known CustomReportItem type
ru_ru: {0} не известный тип CustomReportItem.

# RdlEngineConfig_Error_UnableCreateInstance
source: Unable to create instance of '{0}' for provider '{1}'
ru_ru: Не удалось создать экземпляр '{0}' для поставщика '{1}'

# ReportLog_Error_Severity
source: Severity
ru_ru: Важность

# Subreport_Error_SubreportNotParameter
source: Subreport {0} doesn't define parameter {1}.
ru_ru: В подотчёте {0} не объявлен параметр {1}.

# TableRows_Error_TableRowsMustOwnedTable
source: Internal error. TableRows must be owned eventually by a table.
ru_ru: Внутренняя ошибка: Строки таблицы должны принадлежать таблице.

# TableRow_Error_TableRowNotRelatedToTable
source: Internal error: TableRow not related to a Table
ru_ru: Внутренняя ошибка: Строка таблицы не связана с таблицей.

# Table_Error_RecursiveGroupsMustOnlyGroupDefinition
source: Error: Recursive groups must be the only group definition.
ru_ru: Ошибка: Рекурсивная группа должна быть единственным определением группы.

# MhtBuilder_Error_UnableDownload
source: unable to download '{0}': {1}
ru_ru: Не удалось загрузить '{0}': {1}

# Lexer_ErrorP_InvalidNumberConstant
source: Invalid number constant.
ru_ru: Некорректная числовая константа

# Lexer_ErrorP_UnterminatedString
source: Unterminated string!
ru_ru: Незавершённая строка!

# Lexer_Error_SeparatorMustFollowedNumber
source: '{0}' should be followed by a number
ru_ru: '{0}' должен следовать после числа

# Lexer_Error_UnterminatedComment
source: Unterminated comment!
ru_ru: Незавершённый комментарий!

# Parser_ErrorP_AggregateCannotNestedInAnotherAggregate
source: Aggregate function '{0}' cannot be nested in another aggregate function.
ru_ru: Агрегатная функция '{0}' не может быть вложена в другую агрегатную функцию.

# Parser_ErrorP_AggregateCannotUsedWithinGrouping
source: Aggregate function '{0}' cannot be used within a Grouping expression.
ru_ru: Агрегатная функция '{0}' не может быть использована в выражении группирования.

# Parser_ErrorP_AND_OR_RequiresBoolean
source: AND/OR operations require both sides to be boolean expressions.
ru_ru: AND/OR операции требуют, чтобы с обоих сторон были логические выражения.

# Parser_ErrorP_AtColumn
source: At column {0}
ru_ru: В столбце {0}

# Parser_ErrorP_BracketExpected
source: ')' expected but not found.
ru_ru: ')' ожидалась, но не найдена.

# Parser_ErrorP_ChooseFirstArgumentMustNumeric
source: First argument to Choose function must be numeric.
ru_ru: Первый аргумент функции Choose должен быть числовым.

# Parser_ErrorP_ChooseRequires2Arguments
source: Choose function requires at least 2 arguments.
ru_ru: Функция Choose требует как минимум 2 аргумента.

# Parser_ErrorP_ClassUnknown
source: Class {0} is not known.
ru_ru: Неизвестный класс {0}.

# Parser_ErrorP_EndExpressionExpected
source: End of expression expected.
ru_ru: Ожидался конец выражения.

# Parser_ErrorP_ExpectingComma
source: Expecting ',' or ')'.
ru_ru: Ожидается ',' или ')'.

# Parser_ErrorP_FieldNotFound
source: Field '{0}' not found.
ru_ru: Поле '{0}' не найдено

# Parser_ErrorP_FieldNotInDataSet
source: Field '{0}' is not in DataSet {1}.
ru_ru: Поля '{0}' нет в наборе данных {1}.

# Parser_ErrorP_FieldsRequires1Argument
source: Fields collection requires exactly 1 argument.
ru_ru: Коллекция Fields требует 1 аргумент.

# Parser_ErrorP_FieldSupportsValueAndIsMissing
source: Field '{0}' only supports 'Value' and 'IsMissing' properties.
ru_ru: Поле '{0}' поддерживает только свойства 'Value' и 'IsMissing'.

# Parser_ErrorP_FormatRequires2Arguments
source: Format function requires 2 arguments.
ru_ru: Функция Format требует 2 аргумента.

# Parser_ErrorP_FoundValue
source: Found '{0}'
ru_ru: Найдено '{0}'

# Parser_ErrorP_FunctionOfClassUnknown
source: Function '{0}' of class '{1}' is not known.
ru_ru: Неизвестная функция '{0}' класса '{1}'.

# Parser_ErrorP_FunctionUnknown
source: Function {0} is not known.
ru_ru: Неизвестная функция {0}.

# Parser_ErrorP_GlobalsNotFound
source: Globals '{0}' not found.
ru_ru: Элемент '{0}' коллекции Globals не найден.

# Parser_ErrorP_GlobalsRequires1Argument
source: Globals collection requires exactly 1 argument.
ru_ru: Коллекция Globals требует 1 аргумент.

# Parser_ErrorP_IdentifierExpected
source: Constant or Identifier expected but not found.
ru_ru: Ожидалась константа или идентификатор.

# Parser_ErrorP_iff_function_requires_3_arguments
source: iff function requires 3 arguments.
ru_ru: Функция iff требует 3 аргумента.

# Parser_ErrorP_Invalid_function_arguments
source: Invalid function arguments.
ru_ru: Некорректные аргументы функции.

# Parser_ErrorP_ItemNotFound
source: ReportItem '{0}' not found.
ru_ru: Элемент '{0}' коллекции ReportItem не найден.

# Parser_ErrorP_ItemSupportsValue
source: ReportItem '{0}' only supports 'Value' property.
ru_ru: Элемент '{0}' коллекции ReportItem поддерживает только свойство 'Value'.

# Parser_ErrorP_MinusNeedNumbers
source: '-' operator works only on numbers.
ru_ru: Оператор '-' работает только с числами.

# Parser_ErrorP_NoScope4Aggregate
source: No scope provided for aggregate function '{0}' but more than one DataSet defined.
ru_ru: Нет области предусмотренной для агрегатной функции, но определено более одного набора данных.

# Parser_ErrorP_NotCodeMethod
source: {0} is not a Code method. Verify the name of the method and its arguments match an existing code function.
ru_ru: {0} не является известным методом. Проверьте имя метода и его аргументы, которые должны соответствовать существующей функцию.

# Parser_ErrorP_NOTRequiresBoolean
source: NOT requires boolean expression.
ru_ru: Операция NOT требует логического выражения.

# Parser_ErrorP_ParameterNotFound
source: Report parameter '{0}' not found.
ru_ru: Параметр отчёта '{0}' не найден.

# Parser_ErrorP_ParametersRequires1Argument
source: Parameters collection requires exactly 1 argument.
ru_ru: Коллекция Parameters требует одного аргумента.

# Parser_ErrorP_ParameterSupportsValueAndLabel
source: Parameter '{0}' only supports 'Value' and 'Label' properties.
ru_ru: Параметр '{0}' поддерживает только свойства 'Value' и 'Label'.

# Parser_ErrorP_ReportItemsRequires1Argument
source: ReportItems collection requires exactly 1 argument.
ru_ru: Коллекция ReportItems требует одного аргумента.

# Parser_ErrorP_RunningValueArgumentInvalid
source: RunningValue 'Function' argument is invalid.
ru_ru: Аргумент 'Function' функции RunningValue некорректен.

# Parser_ErrorP_RunningValueNotSupported
source: RunningValue function '{0}' is not supported.
ru_ru: Функция '{0}' для функции RunningValue не поддерживается.

# Parser_ErrorP_RunningValue_takes_2_or_3_arguments
source: RunningValue takes 2 or 3 arguments.
ru_ru: Функция RunningValue требует 2 или 3 аргумента.

# Parser_ErrorP_ScopeIdentifer
source: Illegal scope identifer specified.
ru_ru: Идентификатор указан в неправильном месте.

# Parser_ErrorP_ScopeMustConstant
source: {0} function's scope must be a constant.
ru_ru: Выражение функции {0} должно быть постоянным.

# Parser_ErrorP_ScopeNotKnownDataSet
source: Scope '{0}' does not reference a known DataSet.
ru_ru: Выражение '{0}' не ссылается на известный набор данных.

# Parser_ErrorP_ScopeNotKnownGrouping
source: Scope '{0}' is not a known Grouping, DataSet or DataRegion name.
ru_ru: Выражение '{0}' не является названием группы, набора данных или региона данных.

# Parser_ErrorP_ScopeNotSpecifiedInHeaderOrFooter
source: Scope '{0}' can't be specified in a Page Header or Footer expression.
ru_ru: Выражение '{0}' не может быть указано в колонтитулах.

# Parser_ErrorP_SecondMustString
source: Second argument to Format function must be a string.
ru_ru: Второй аргумент функции Format должен быть строкой.

# Parser_ErrorP_SwitchMustBoolean
source: Switch function must have a boolean expression every other argument.
ru_ru: Каждый нечётный аргумент функции Switch должен быть логическим выражением.

# Parser_ErrorP_SwitchMustEvenArguments
source: Switch function must have an even number of arguments.
ru_ru: Функция Switch должна иметь чётное количество аргументов.

# Parser_ErrorP_SwitchRequires2Arguments
source: Switch function requires at least 2 arguments.
ru_ru: Функция Switch требует как минимум 2 аргумента.

# Parser_ErrorP_UnknownIdentifer
source: '{0}' is an unknown identifer.
ru_ru: Неизвестный идентификатор: '{0}'.

# Parser_ErrorP_UnknownProperty
source: {0} is not a known property for {1}.
ru_ru: Неизвестное свойство {0} для {1}.

# Parser_ErrorP_UserRequires1Argument
source: User collection requires exactly 1 argument.
ru_ru: Коллекция User требует одного аргумента.

# Parser_ErrorP_UserVarNotFound
source: User variable '{0}' not found.
ru_ru: Элемент коллекции User '{0}' не найден.

# RDLParser_ErrorP_XMLFailed
source: Error: XML failed
ru_ru: Ошибка загрузки XML:

# RDLParser_ErrorP__NoReport
source: Error: RDL doesn't contain a report element.
ru_ru: Ошибка: RDL не содержит элемента "Report"

# Parser_ErrorP_CurlyBracketExpected
source: '}' expected but not found.
ru_ru: ожидалась '}', но не найдена.

# SaveToFile_CheckIf_SameFilesInDir
source: Directory contains file with the same name, do you want to overwrite it?
ru_ru: Такой файл уже существует, вы уверены, что хотите перезаписать его?

# ButtonSave_Text
source: Save
ru_ru: Сохранить

# ButtonCancel_Text
source: Cancel
ru_ru: Отменить

# FileChooser_SaveFileTo_Title
source: Save File As
ru_ru: Сохранить файл как
