Repository: majorsilence/My-FyiReporting
Catalog: RdlViewer/RdlReader/Resources/Strings.*.resx
Languages: ru_ru

# DialogAbout_About
source: RDL Reader displays reports defined using the Report Definition Language Specification. Copyright (C) 2004-2008 fyiReporting Software, LLC Copyright (C) 2012 Peter Gill <peter@majorsilence.com> This file is part of the My-FyiReporting RDL project. Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. For additional information, email peter@majorsilence.com or visit the website https://github.com/majorsilence/My-FyiReporting.
ru_ru: Просмотрщик отчётов отображает отчеты, определенные с помощью языка определения отчётов (RDL). Copyright (C) 2004-2008 fyiReporting Software, LLC Copyright (C) 2012 Петр Гилл <peter@majorsilence.com> Этот файл является частью проекта My-FyiReporting RDL. Под лицензией Apache, версии 2.0 (the "License"); Вы не можете использовать этот файл только в соответствии с лицензией. Вы можете получить копию лицензии на http://www.apache.org/licenses/LICENSE-2.0 Если иное не требуется законодательством или согласовано в письменной форме, программное обеспечение распространяется под Лицензия "КАК ЕСТЬ", БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА, явных или подразумеваемых. См. Лицензию на других языках, регулирующая разрешения и ограничения в рамках лицензии. Для получения дополнительной информации, напишите peter@majorsilence.com или посетите сайт https://github.com/majorsilence/My-FyiReporting.

# DialogAbout_ShowD_Exception
source: Exception
ru_ru: Ошибка

# DialogAbout_Version
source: Version {0}
ru_ru: Версия {0}

# RdlReader_menuFileOpen_Click_Filter
source: RDL files (*.rdl)|*.rdl|Encrypted RDL files (*.encrypted)|*.encrypted|All files (*.*)|*.*
ru_ru: Файлы отчётов (*.rdl)|*.rdl|Все файлы (*.*)|*.*

# RdlReader_SaveG_NotValidFileType
source: {0} is not a valid file type. File extension must be PDF, XML, HTML, CSV, MHT, RTF, TIF, XLSX.
ru_ru: {0} - некорректный тип файла. Допустимые расширения файлов: PDF, XML, HTML, CSV, MHT, RTF, TIF, XLSX.

# RdlReader_SaveG_SaveAsError
source: Save As Error
ru_ru: Ошибка при сохранении

# RdlReader_ShowC_PrintError
source: Print error:
ru_ru: Ошибка печати:

# RdlReader_ShowC_PrintOneFile
source: Can only print one file at a time.
ru_ru: Печатать можно только один файл за раз.

# RdlReader_ShowD_ReportNotLoaded
source: The specified report [ {0} ] could not be loaded.
ru_ru: Указанный отчёт [ {0} ] не может быть загружен.

# RdlReader_ShowF_Export
source: Export
ru_ru: Экспорт

# RdlReader_ShowF_WantSaveColorsInTIF
source: Do you want to save colors in TIF file?
ru_ru: Хотите сохранить изображение в TIF-файл?

# RdlReader_Show_MyFyiReporting
source: My-FyiReporting
ru_ru: Редактор отчётов

# ZoomTo_ShowI_MagnificationLevelInvalid
source: Magnification level is an invalid number.
ru_ru: Уровень увеличения является недопустимым числом.

# RdlReader_menuFileSaveAs_Click_FilesFilter
source: PDF files (*.pdf)|*.pdf|XML files (*.xml)|*.xml|HTML files (*.html)|*.html|CSV files (*.csv)|*.csv|RTF files (*.rtf)|*.rtf|TIF files (*.tif)|*.tif|Excel 2007 Table Only (*.xlsx)|*.xlsx|Excel 2007 (*.xlsx)|*.xlsx|MHT files (*.mht)|*.mht
ru_ru: PDF (*.pdf)|*.pdf|XML (*.xml)|*.xml|HTML (*.html)|*.html|CSV files (*.csv)|*.csv|RTF (*.rtf)|*.rtf|TIF (*.tif)|*.tif|Excel 2007 только таблица (*.xlsx)|*.xlsx|Excel 2007 (*.xlsx)|*.xlsx|MHT (*.mht)|*.mht
