Repository: majorsilence/My-FyiReporting
Catalog: RdlDesign/Resources/Strings.*.resx
Languages: es, fr

# DesignXmlDraw_BodyRegion_Title
source: Body ↑
es: Тело ↑
fr: Principal↑

# DesignXmlDraw_PageFooterRegion_Title
source: Page Footer ↑
es: Нижний колонтитул ↑
fr: Pied de page ↑

# DesignXmlDraw_PageHeaderRegion_Title
source: Page Header ↑
es: Верхний колонтитул ↑
fr: En-tête de page ↑

# RdlDesigner_Status_cm
source: cm
es: см

# RdlDesigner_Status_Height
source: height
es: высота
fr: hauteur

# DesignCtl_SelectionName_Group
source: Group
es: Grupo
fr: Groupe

# DesignCtl_SelectionName_GroupSelection
source: Group Selection
es: Групповое выделение
fr: Sélection de groupe

# DesignCtl_SelectionName_in
source: in
es: в
fr: dans

# DesignCtl_SelectionName_Unnamed
source: *Unnamed*
es: *Безымянный*
fr: *Anonyme*

# RdlDesigner_Status_Ch
source: Ch
es: Columna

# RdlDesigner_Status_Ln
source: Ln
es: Fila

# PropertyDialog_BuildReportItemTabs_Border
source: Border
es: Borde
fr: Frontière

# PropertyDialog_BuildReportItemTabs_Chart
source: Chart
es: Gráfico
fr: Graphique

# PropertyDialog_BuildReportItemTabs_Filters
source: Filters
es: Фильтры
fr: Filtres

# PropertyDialog_BuildReportItemTabs_Grid
source: Grid
es: Сетка

# PropertyDialog_BuildReportItemTabs_Grouping
source: Grouping
es: Grupo
fr: Groupement

# PropertyDialog_BuildReportItemTabs_GroupSelectionProperties
source: Group Selection Properties
es: Свойства группового выделения
fr: Propriétés de sélection de groupe

# PropertyDialog_BuildReportItemTabs_Image
source: Image
es: Imagen

# PropertyDialog_BuildReportItemTabs_Interactivity
source: Interactivity
es: Interactividad
fr: Interactivité

# PropertyDialog_BuildReportItemTabs_List
source: List
es: Lista
fr: Liste

# PropertyDialog_BuildReportItemTabs_Matrix
source: Matrix
es: Matriz
fr: Matrice

# PropertyDialog_BuildReportItemTabs_Name_Position
source: Name/Position
es: Название/Позиция
fr: Nom/Poste

# PropertyDialog_BuildReportItemTabs_Sorting
source: Sorting
es: Ordenación
fr: Classement

# PropertyDialog_BuildReportItemTabs_StaticSeries
source: Static Series
es: Статические серии
fr: Série statique

# PropertyDialog_BuildReportItemTabs_Style
source: Style
es: Estilo

# PropertyDialog_BuildReportItemTabs_Subreport
source: Subreport
es: Subinforme
fr: Sous-état

# PropertyDialog_BuildReportItemTabs_Table
source: Table
es: Tabla
fr: Tableau

# PropertyDialog_BuildReportItemTabs_TableColumn
source: Table Column
es: Столбец таблицы
fr: Colonne du tableau

# PropertyDialog_BuildReportItemTabs_TableRow
source: Table Row
es: Строка таблицы
fr: Rangée de tableau

# PropertyDialog_BuildReportItemTabs_Text
source: Text
es: Texto
fr: Texte

# PropertyDialog_BuildChartAxisTabs_Axis
source: Axis
es: Eje
fr: Axe

# PropertyDialog_BuildChartAxisTabs_ChartCategoryAxis
source: Chart Category (X) Axis
es: Категория (ось X)
fr: Axe de la catégorie de graphique (X)

# PropertyDialog_BuildChartAxisTabs_ChartValueAxis
source: Chart Value (Y) Axis
es: Значение (ось Y)
fr: Axe des valeurs du graphique (y)

# PropertyDialog_BuildChartLegendTabs_ChartLegendProperties
source: Chart Legend Properties
es: Свойства легенды диаграммы
fr: Propriétés de la légende du graphique

# PropertyDialog_BuildChartLegendTabs_Legend
source: Legend
es: Leyenda
fr: Légende

# PropertyDialog_BuildDataSetsTabs_Data
source: Data
es: Datos
fr: Données

# PropertyDialog_BuildDataSetsTabs_DataSet
source: DataSet
es: Conjunto de datos
fr: Jeu de données

# PropertyDialog_BuildDataSetsTabs_DataSet_Header
source: DataSet
es: Conjunto de datos
fr: Jeu de données

# PropertyDialog_BuildDataSetsTabs_QueryParameters
source: Query Parameters
es: Параметры запроса
fr: Paramètres de requête

# PropertyDialog_BuildGroupingTabs_CategoryGrouping
source: Category Grouping
es: Группа категории
fr: Regroupement de catégories

# PropertyDialog_BuildGroupingTabs_GroupingAndSorting
source: Grouping and Sorting
es: Группировка и сортировка
fr: Regroupement et tri

# PropertyDialog_BuildGroupingTabs_SeriesGrouping
source: Series Grouping
es: Группа серии
fr: Regroupement de séries

# PropertyDialog_BuildReportTabs_Body
source: Body
es: Cuerpo
fr: Principal

# PropertyDialog_BuildReportTabs_Code
source: Code
es: Código

# PropertyDialog_BuildReportTabs_Modules_Classes
source: Modules/Classes
es: Модули/Классы

# PropertyDialog_BuildReportTabs_Parameters
source: Parameters
es: Parámetros
fr: Paramètres

# PropertyDialog_BuildReportTabs_Report
source: Report
es: Informe
fr: Rapport

# PropertyDialog_BuildReportTabs_ReportProperties
source: Report Properties
es: Свойства отчёта
fr: Propriétés du rapport

# PropertyDialog_BuildReportTabs_XMLRendering
source: XML Rendering
es: Вывод XML
fr: Rendu XML

# PropertyDialog_BuildTitle_CategoryAxisTitle
source: Category (X) Axis Title
es: Заголовок категории (ось X)
fr: Catégorie (X) Axe Titre

# PropertyDialog_BuildTitle_ChartTitle
source: Chart Title
es: Título del gráfico
fr: Titre du graphique

# PropertyDialog_BuildTitle_ValueAxisRightTitle
source: Value (Y) Axis (Right) Title
es: Заголовок значения (ось Y) справа
fr: Valeur (y) Axe (droite) Titre

# PropertyDialog_BuildTitle_ValueAxisTitle
source: Value (Y) Axis Title
es: Заголовок значения (ось Y)
fr: Valeur (y) Titre de l'axe

# StyleTextCtl_InitTextStyles_Caption
source: Caption
es: Encabezado
fr: Légende

# DesignCtl_Undo_Align
source: Align
es: выравнивание
fr: Aligner

# DesignCtl_Undo_Cut
source: Cut
es: вырезание
fr: Couper

# DesignCtl_Undo_Delete
source: Delete
es: eliminación
fr: Supprimer

# DesignCtl_Undo_DeleteGrouping
source: Delete Grouping
es: удаление группы
fr: Supprimer le regroupement

# DesignCtl_Undo_DeleteTable
source: Delete Table
es: удаление таблицы
fr: Supprimer la table

# DesignCtl_Undo_DeleteTableColumn
source: Delete Table Column
es: удаление столбца таблицы
fr: Supprimer la colonne du tableau

# DesignCtl_Undo_DeleteTableGroup
source: Delete Table Group
es: удаление группы таблицы
fr: Supprimer un groupe de tables

# DesignCtl_Undo_DeleteTableRow
source: Delete Table Row
es: удаление строки таблицы
fr: Supprimer une ligne de table

# DesignCtl_Undo_Dialog
source: Dialog
es: диалог
fr: Dialogue

# DesignCtl_Undo_DialogGrouping
source: Dialog Grouping
es: изменение группы
fr: Groupement de boîtes de dialogue

# DesignCtl_Undo_DialogTableGroupEdit
source: Dialog Table Group Edit
es: изменение группы таблицы
fr: Boîte de dialogue Table d'édition de groupe

# DesignCtl_Undo_Insert
source: Insert
es: inserción
fr: Insérer

# DesignCtl_Undo_InsertCategoryGrouping
source: Insert Category Grouping
es: вставку группы категории
fr: Insérer un regroupement de catégories

# DesignCtl_Undo_InsertChart
source: Insert Chart
es: вставку диаграммы
fr: Insérer un graphique

# DesignCtl_Undo_InsertMatrix
source: Insert Matrix
es: вставку матрицы
fr: Matrice d'insertion

# DesignCtl_Undo_InsertSeriesGrouping
source: Insert Series Grouping
es: вставку группы серии
fr: Regroupement de séries d'inserts

# DesignCtl_Undo_InsertTable
source: Insert Table
es: вставку таблицы
fr: Insérer la table

# DesignCtl_Undo_InsertTableColumn
source: Insert Table Column
es: вставку столбца таблицы
fr: Insérer une colonne de tableau

# DesignCtl_Undo_InsertTableGroup
source: Insert Table Group
es: вставку группы таблицы
fr: Insérer un groupe de tables

# DesignCtl_Undo_InsertTableRow
source: Insert Table Row
es: вставку строки талбицы
fr: Insérer une ligne de tableau

# DesignCtl_Undo_MatrixDelete
source: Matrix Delete
es: удаление матрицы
fr: Suppression de matrice

# DesignCtl_Undo_MatrixDeleteGroup
source: Matrix Delete Group
es: удаление группы матрицы
fr: Groupe de suppression de matrice

# DesignCtl_Undo_MatrixDialog
source: Matrix Dialog
es: изменение матрицы
fr: Boîte de dialogue Matrice

# DesignCtl_Undo_MatrixEdit
source: Matrix Edit
es: изменение матрицы
fr: Édition matricielle

# DesignCtl_Undo_MatrixInsertColumnGroup
source: Matrix Insert Column Group
es: вставку группы столбца матрицы
fr: Groupe de colonnes d'insertion matricielle

# DesignCtl_Undo_MatrixInsertRowGroup
source: Matrix Insert Row Group
es: вставку группы строки матрицы
fr: Groupe de lignes d'insertion matricielle

# DesignCtl_Undo_Move
source: Move
es: movimiento
fr: Bouger

# DesignCtl_Undo_Move_Size
source: Move/Size
es: перемещение/изменение размера
fr: Déplacement/Taille

# DesignCtl_Undo_Padding
source: Padding
es: отступ от границы
fr: Rembourrage

# DesignCtl_Undo_Paste
source: Paste
es: inserción

# DesignCtl_Undo_Size
source: Size
es: cambio de tamaño
fr: Taille

# DesignCtl_Undo_Spacing
source: Spacing
es: отступ
fr: Espacement

# DesignCtl_Undo_Style
source: Style
es: изменение стиля

# DesignCtl_Undo_TableDialog
source: Table Dialog
es: изменение таблицы
fr: Boîte de dialogue Table

# DesignCtl_Undo_TextboxValue
source: Textbox Value
es: изменение текста
fr: Valeur de la zone de texte

# NodeChangedUndo_GetDescription_change
source: change
es: modificación
fr: changement

# NodeInsertedUndo_GetDescription_insert
source: insert
es: inserción
fr: insérer

# NodeRemovedUndo_GetDescription_remove
source: remove
es: eliminación
fr: enlever

# PropertyPrintFirstLast_SetProp_change
source: change
es: modificación
fr: changement

# PropertyReportItem_Undo_ColumnSpanchange
source: Column Span change
es: изменение охвата столбцов
fr: Modification de l'étendue des colonnes

# PropertyReportItem_Undo_NameChange
source: Name change
es: изменение названия
fr: Changement de nom

# PropertyReport_Undo_Body
source: Body
es: в теле отчета
fr: Principal

# PropertyReport_Undo_change
source: change
es: modificación
fr: changement

# PropertyTableUIEditor_EditValue_TableDialog
source: Table Dialog
es: изменение таблицы
fr: Boîte de dialogue Table

# RdlDesigner_menuData_Popup_New
source: New...
es: Создать...
fr: Nouveau...

# RdlDesigner_menuEdit_Popup_Undo
source: Undo
es: Cancelar
fr: Défaire

# RdlDesigner_Undo_DataSetDialog
source: DataSet Dialog
es: изменение набора данных
fr: Boîte de dialogue DataSet

# RdlDesigner_Undo_DataSourcesDialog
source: DataSources Dialog
es: изменение источника данных
fr: Boîte de dialogue Sources de données

# RdlDesigner_Undo_EmbeddedImagesDialog
source: Embedded Images Dialog
es: изменение встроенного изображения
fr: Boîte de dialogue Images intégrées

# SingleCtlDialog_Undo_AppearanceChange
source: Appearance change
es: изменение внешнего вида
fr: Changement d'apparence

# SingleCtlDialog_Undo_BackgroundChange
source: Background change
es: изменение фона
fr: Changement d'arrière-plan

# SingleCtlDialog_Undo_BorderChange
source: Border change
es: изменение границы
fr: Changement de frontière

# SingleCtlDialog_Undo_FiltersChange
source: Filters change
es: изменение фильтров
fr: Changement de filtres

# SingleCtlDialog_Undo_GroupingChange
source: Grouping change
es: изменение группирования
fr: Changement de regroupement

# SingleCtlDialog_Undo_ImageChange
source: Image change
es: изменение изображения
fr: Changement d'image

# SingleCtlDialog_Undo_InteractivityChange
source: Interactivity change
es: изменение интерактивности
fr: Changement d'interactivité

# SingleCtlDialog_Undo_ReportCodeChange
source: Report code change
es: изменение кода отчёта
fr: Signaler une modification de code

# SingleCtlDialog_Undo_ReportModules_ClassesChange
source: Report Modules/Classes change
es: изменение модулей/классов отчёта
fr: Modification des modules/classes de rapport

# SingleCtlDialog_Undo_SortChange
source: Sort change
es: изменение сортировки
fr: Trier le changement

# SingleCtlDialog_Undo_SubreportChange
source: Subreport change
es: изменение подотчёта
fr: Modification du sous-rapport

# SingleCtlDialog_Undo_VisibilityChange
source: Visibility change
es: изменение видимости
fr: Changement de visibilité

# RdlDesigner_menuTools_Popup_StartDesktop
source: Start Desktop
es: Iniciar servidor
fr: Démarrer le bureau

# RdlDesigner_menuTools_Popup_StopDesktop
source: Stop Desktop
es: Остановить сервер
fr: Arrêter le bureau

# CodeCtl_Show_CodeVerification
source: Code Verification
es: Проверка кода
fr: Vérification du code

# CodeCtl_Show_NoErrors
source: No errors
es: Без ошибок
fr: Aucune erreur

# DataSetRowsCtl_ShowB_ErrorReadingDataRows
source: Error Reading Data Rows
es: Ошибка чтения строк данных
fr: Erreur lors de la lecture des lignes de données

# DataSetRowsCtl_ShowB_UnableConvert
source: Unable to convert {1} to {0}: {2}
es: Неудалось преобразовать {1} к {0}: {2}
fr: Impossible de convertir {1} en {0} : {2}

# DataSetRowsCtl_ShowB_WantSeeErrors
source: Do you want to see any more errors?
es: Хотите увидеть подробности ошибки?
fr: Voulez-vous voir d'autres erreurs?

# DataSetRowsCtl_ShowC_FileNameRequired
source: File name required when 'Use XML file for data checked'
es: Название файла необходимо, когда отмечено 'Использовать XML файл для данных'
fr: Nom de fichier requis lorsque l'option « Utiliser un fichier XML pour les données vérifiées »

# DataSetRowsCtl_ShowC_UnableLocateDSR
source: Unable to locate DataSource Shared file. Try saving report first
es: Не удалось найти общий источник данных. Попробуйте сначала сохранить отчёт
fr: Impossible de localiser le fichier partagé DataSource. Essayez d'abord d'enregistrer le rapport

# DataSetRowsCtl_Show_DatasourceNotFound
source: Datasource '{0}' not found.
es: Источник данных '{0}' не найден
fr: Source de données '{0}' introuvable.

# DataSetRowsCtl_Show_LoadFailed
source: Load Failed
es: Ошибка загрузки
fr: Échec du chargement

# DataSetsCtl_Show_Name
source: Name
es: Nombre
fr: Nom

# DesignCtl_ShowB_Copy
source: Copy
es: Копирование
fr: Copier

# DesignCtl_ShowB_CustomReportItemError
source: Error building CustomReportItem menus: {0}
es: Ошибка постоения меню CustomReportItem: {0}
fr: Erreur lors de la création des menus CustomReportItem : {0}

# DesignCtl_ShowB_WantReplaceCell
source: Do you want to replace contents of TableCell?
es: Хотите заменить содержимое ячейки?
fr: Voulez-vous remplacer le contenu de TableCell?

# DesignCtl_ShowB_WantSelect
source: Do you want to select the {0}?
es: Хотите выбрать {0}?
fr: Voulez-vous sélectionner le {0}?

# DesignCtl_ShowC_IllegalInsertSyntax
source: Internal error: illegal insert syntax:
es: Внутренняя ошибка: некорректный код вставки:
fr: Erreur interne : insertion illégale syntaxe :

# DesignCtl_Show_ChartsInsert
source: Charts can only be inserted in the body of the report.
es: Диаграммы могут быть вставлены только в тело отчёта
fr: Les graphiques ne peuvent être insérés que dans le corps du rapport.

# DesignCtl_Show_CustomReportItem
source: CustomReportItem {0} method GetCustomReportItemXml must return XML enclosed by <CustomReportItem> and </CustomReportItem> XML in error: {1}
es: Метод {0}.GetCustomReportItemXml должен возвращать XML заключённый в теги <CustomReportItem> и </CustomReportItem> Ошибка: {1}

# DesignCtl_Show_CustomReportItemException
source: Exception building CustomReportItem insert: {0}
es: Ошибка вставки CustomReportItem: {0}
fr: Création d'exceptions Insertion CustomReportItem : {0}

# DesignCtl_Show_Insert
source: Insert
es: Вставка
fr: Insérer

# DesignCtl_Show_ListsInBody
source: Lists can only be inserted in the body of the report.
es: Списки могут быть вставлены только в тело отчёта
fr: Les listes ne peuvent être insérées que dans le corps du rapport.

# DesignCtl_Show_MatrixsInBody
source: Matrixs can only be inserted in the body of the report.
es: Матрицы могут быть вставлены только в тело отчёта
fr: Les matrices ne peuvent être insérées que dans le corps du rapport.

# DesignCtl_Show_Paste
source: Paste
es: Вставка

# DesignCtl_Show_SubreportsInBody
source: Subreports can only be inserted in the body of the report.
es: Подотчёты могут быть вставлены только в тело отчёта
fr: Les sous-rapports ne peuvent être insérés que dans le corps du rapport.

# DesignCtl_Show_TablesInBody
source: Tables can only be inserted in the body of the report.
es: Таблицы могут быть вставлены только в тело отчёта
fr: Les tableaux ne peuvent être insérés que dans le corps du rapport.

# DesignCtl_Show_UnableCreateRDL
source: Unable to create RDL syntax
es: Не удалось создать RDL-код
fr: Impossible de créer la syntaxe RDL

# DesignerUtility_Show_ConnectDataProviderError
source: Unable to connect using dataProvider '{0}'
es: Не удалось установить соединение через поставщика данных '{0}'
fr: Impossible de se connecter à l'aide du dataProvider '{0}'

# DesignerUtility_Show_OpenConnectionError
source: Unable to open connection
es: Не удалось установить соединение
fr: Impossible d'ouvrir la connexion

# DesignerUtility_Show_SharedConnectionError
source: Unable to open shared connection, password or file is invalid.
es: Не удалось открыть общее соединение, пароль или файл некорректны
fr: Impossible d'ouvrir la connexion partagée, le mot de passe ou le fichier n'est pas valide.

# DesignerUtility_Show_SQLError
source: SQL Error
es: Ошибка SQL
fr: Erreur SQL

# DesignerUtility_Show_TestConnection
source: Test Connection
es: Проверка соединения
fr: Tester la connexion

# DesignXmlDraw_Show_XMLInvalid
source: XML is Invalid
es: Некорректный XML
fr: XML n'est pas valide

# DialogDatabase_ShowD_SelectDataProvider
source: Please select a Data Provider before testing.
es: Выберите источник данных перед тестом.
fr: Veuillez sélectionner un fournisseur de données avant de tester.

# DialogDatabase_Show_ConnectionSuccessful
source: Connection successful!
es: Соединение успешно установлено!
fr: Connexion réussie !

# DialogDatabase_Show_InternalError
source: Internal Error
es: Error interno
fr: Erreur interne

# DialogDataSourceRef_bOK_Click_UnableCreateDSR
source: Unable to create data source reference file
es: Не удалось создать общий источник данных
fr: Impossible de créer le fichier de référence de la source de données

# DialogDataSources_ShowE_DataSourceMustUniqueN
source: Each DataSource must have a unique name. '{0}' is repeated.
es: Каждый источник данных должен иметь уникальное имя. '{0}' уже используется.
fr: Chaque DataSource doit avoir un nom unique. « {0} » est répété.

# DialogDataSources_ShowE_DataSources
source: Data Sources
es: Orígenes de datos
fr: Sources des données

# DialogDataSources_ShowE_NameInvalid
source: Name '{0}' contains invalid characters.
es: Название '{0}' содержит некорректные символы.
fr: Le nom '{0}' contient des caractères non valides.

# DialogDataSources_ShowE_NameMustSpecified
source: Name must be specified for all DataSources.
es: Название должно быть указано у каждого источника данных.
fr: Le nom doit être spécifié pour toutes les DataSources.

# DialogEmbeddedImages_ShowE_CopyImageBeforePaste
source: Copy image into clipboard before attempting to paste.
es: Скопируйте изображение в буфер обмена, прежде чем пытаться вставить.
fr: Copiez l'image dans le presse-papiers avant d'essayer de coller.

# DialogEmbeddedImages_ShowE_ErrorConvertingImage
source: Error converting image data
es: Ошибка преобразования изображения
fr: Erreur lors de la conversion des données d'image

# DialogEmbeddedImages_ShowE_Image
source: Image
es: Imagen

# DialogEmbeddedImages_ShowE_ImageMustUniqueName
source: Each embedded image must have a unique name. '{0}' is repeated.
es: Каждое встроенное изображение должно иметь уникальное имя. '{0}' уже повторяется.
fr: Chaque image intégrée doit avoir un nom unique. « {0} » est répété.

# DialogEmbeddedImages_ShowE_NameInvalid
source: Name '{0}' contains invalid characters.
es: Название '{0}' содержит некорректные символы.
fr: Le nom '{0}' contient des caractères non valides.

# DialogEmbeddedImages_ShowE_NameMustSpecified
source: Name must be specified for all embedded images.
es: Название должно быть указано для каждого встроенного изображения.
fr: Le nom doit être spécifié pour toutes les images intégrées.

# DialogFilterOperator_Show_OperatorInList
source: Operator '{0}' must be in the operator list
es: Оператор '{0}' должен быть в списке операторов
fr: L'opérateur '{0}' doit figurer dans la liste des opérateurs.

# DialogFilterOperator_Show_PickFilterOperator
source: Pick Filter Operator
es: Выберите оператор фильтра
fr: Opérateur de filtre de sélection

# DialogNewChart_ShowC_FillExpression
source: Please fill out the chart data expression, or include a series.
es: Пожалуйста, заполните выражение данных диаграммы или включать серию.
fr: Veuillez remplir l'expression de données du graphique ou inclure une série.

# DialogNewChart_ShowC_FillYAndBubbleExpressions
source: Please fill out the chart Y coordinate and Bubble width expressions.
es: Пожалуйста, заполните выражения Y-координаты и ширины пузырька.
fr: Veuillez remplir le tableau des expressions de coordonnées Y et de largeur de bulle.

# DialogNewChart_ShowC_FillYExpression
source: Please fill out the chart Y coordinate data expression.
es: Пожалуйста, заполните выражение Y-координаты.
fr: Veuillez remplir le tableau Expression des données de coordonnées Y.

# DialogToolOptions_Show_ConfigError
source: Error processing Desktop Configuration; using defaults. {0}
es: Ошибка обработки файла конфигурации; используется конфигурация по умолчанию. {0}
fr: Erreur de traitement de la configuration du bureau ; à l'aide des valeurs par défaut. {0}

# DialogToolOptions_Show_Options
source: Options
es: Configuración

# DialogToolOptions_Show_RecentFilesMax
source: Recent files maximum must be an integer between 1 and 50
es: Максимально количество недавних файлов должно быть целым числом от 1 до 50
fr: Les fichiers récents doivent être composés au maximum d'un nombre entier compris entre 1 et 50

# DialogValidateRdl_ShowC_SelectRDLTab
source: Select the 'RDL Text' tab before validating.
es: Выберите вкладку "RDL (исходный код)" перед проверкой.
fr: Sélectionnez l'onglet 'RDL Text' avant de valider.

# DrillParametersDialog_ShowC_ReportHasErrors
source: Report has errors and cannot be processed.
es: El informe tiene errores y no se puede procesar.
fr: Le rapport contient des erreurs et ne peut pas être traité.

# DrillParametersDialog_Show_ErrorReading
source: Error reading report file
es: Ошибка чтения файла отчёта
fr: Erreur lors de la lecture du fichier de rapport

# DrillParametersDialog_Show_ReportLoadFailed
source: Report load failed
es: Ошибка загрузки отчёта
fr: Échec du chargement du rapport

# DrillParametersDialog_Show_ValueMustSpecified
source: Value must be specified for every parameter
es: Значение должно быть указано для каждого параметра
fr: La valeur doit être spécifiée pour chaque paramètre

# FindTab_ShowE_InvalidLN
source: Invalid Line Number
es: Некорректный номер строки.
fr: Numéro de ligne non valide

# FontCtl_Show_InvalidFontSize
source: Invalid Font Size
es: Некорректный размер шрифта
fr: Taille de police non valide

# GridCtl_Show_Grid
source: Grid
es: Сетка

# GridCtl_Show_GridRegionsMustDefined
source: Grid must have at least one Header, Details or Footer row defined.
es: У сетки должны быть определены как минимум по одной строке в Заголовке, Теле и Окончании.
fr: La grille doit comporter au moins une ligne d'en-tête, de détails ou de pied de page.

# GroupingCtl_Show_Chart
source: Chart
es: Gráfico
fr: Graphique

# GroupingCtl_Show_ChartSeriesMustHaveLabelForLegend
source: Chart series must have label defined for the legend.
es: Серии диаграмм должны содержать метки для легенд
fr: L'étiquette de la série de graphiques doit être définie pour la légende.

# GroupingCtl_Show_Group
source: Group
es: Grupo
fr: Groupe

# GroupingCtl_Show_Grouping
source: Grouping
es: Agrupación
fr: Groupement

# GroupingCtl_Show_GroupMustDefined
source: Group must be defined.
es: Группа должна быть объявлена
fr: Le groupe doit être défini.

# GroupingCtl_Show_GroupNameError
source: Group Name in Error
es: Ошибка в названии группы
fr: Nom du groupe en erreur

# GroupingCtl_Show_InvalidName
source: {0} is an invalid name.
es: Некорректное имя: {0}
fr: {0} nom n'est pas valide.

# GroupingCtl_Show_Name
source: Name
es: Nombre
fr: Nom
