Repository: majorsilence/My-FyiReporting
Catalog: RdlDesign/Resources/Strings.*.resx
Languages: es, fr

# GroupingCtl_Show_NoExpressionsForGroup
source: No expressions have been defined for the group.
es: В группе не должно быть выражений
fr: Aucune expression n'a été définie pour le groupe.

# MDIChild_ShowF_Export
source: Export
es: Exportar
fr: Exportation

# MDIChild_ShowF_WantDisplayColorsInTIF
source: Do you want to display colors in TIF?
es: Хотите отобразить изображение в TIF?
fr: Voulez-vous afficher les couleurs en TIF?

# MDIChild_ShowG_ExportError
source: Export Error
es: Ошибка экспорта
fr: Erreur d'exportation

# MDIChild_ShowH_fyiReportingDesigner
source: Majorsilence Reporting Designer
es: Editor de informes
fr: Concepteur de rapports Majorsilence

# MDIChild_ShowH_Untitled
source: Untitled
es: Безымянный

# MDIChild_ShowH_WantSaveChanges
source: Do you want to save changes you made to '{0}'?
es: Хотите сохранить изменения в '{0}'?
fr: Voulez-vous enregistrer les modifications que vous avez apportées à {0}?

# PositionCtl_Show_Height
source: Height
es: Altura
fr: Hauteur

# PositionCtl_Show_Invalid
source: {0} is invalid. {1}
es: {0} некорректно. {1}
fr: {0} n'est pas valide. {1}

# PositionCtl_Show_Left
source: Left
es: Izquierda
fr: Gauche

# PositionCtl_Show_Name
source: Name
es: Nombre
fr: Nom

# PositionCtl_Show_SizeInvalid
source: Size is Invalid
es: Размер некорректен
fr: La taille n'est pas valide

# PositionCtl_Show_Top
source: Top
es: Arriba
fr: Retour au début

# PositionCtl_Show_Width
source: Width
es: Ancho
fr: Largeur

# PropertyDialog_ShowF_DataSet
source: DataSet
es: Conjunto de datos
fr: Jeu de données

# PropertyDialog_ShowF_WantDeleteDataset
source: Are you sure you want to delete this dataset?
es: Вы уверены, что хотите удалить этот набор данных?
fr: Êtes-vous sûr de vouloir supprimer cet ensemble de données?

# RdlDesigner_Showl_FormatXML
source: Format XML
es: Формат XML

# RdlDesigner_Show_CustomColorSaveFailed
source: Custom Color Save Failed
es: Ошибка сохранения пользовательского цвета
fr: Échec de l'enregistrement des couleurs personnalisées

# RdlDesigner_Show_ErrorStopProcess
source: Error stopping process
es: Ошибка остановки процесса
fr: Erreur d'arrêt du processus

# RdlDesigner_Show_HelpURLInvalid
source: Help URL Invalid
es: Referencia de ayuda no válida
fr: URL d'aide non valide

# RdlDesigner_Show_PrintError
source: Print error:
es: Ошибка печати:
fr: Erreur d'impression :

# RdlDesigner_Show_PrintOneFile
source: Can only print one file at a time.
es: Solo se puede imprimir un archivo a la vez.
fr: Ne peut imprimer qu'un seul fichier à la fois.

# RdlDesigner_Show_RDLDesign
source: RDL Design
es: Дизайнер отчётов
fr: Conception RDL

# RdlDesigner_Show_ResettingHelpURL
source: Resetting Help URL to default.
es: Ссылка на помощь установлена по умолчанию.
fr: Réinitialisation de l'URL d'aide par défaut.

# RdlDesigner_Show_ResettingSupportURL
source: Resetting Support URL to default.
es: Ссылка на поддержку установлена по умолчанию.
fr: Réinitialisation de l'URL d'assistance par défaut.

# RdlDesigner_Show_SupportURLInvalid
source: Support URL Invalid
es: Referencia de soporte no válida
fr: URL d'assistance non valide

# RdlDesigner_Show_UnableShowReport
source: Unable to Show Report
es: Не удалось отобразить отчёт
fr: Impossible d'afficher le rapport

# RdlDesigner_Show_UnableStartDesktop
source: Unable to start Desktop
es: Не удалось запустить сервер
fr: Impossible de démarrer le bureau

# RdlDesigner_Show_ZoomValueInvalid
source: Zoom Value Invalid
es: Некорректное значение масштаба
fr: Valeur de zoom non valide

# RdlEditPreview_ShowI_ReachedEndDocument
source: Reached End of Document.
es: Достигнут конец документа.
fr: Atteint la fin du document.

# RdlEditPreview_Show_ErrorFind
source: Please retry. Error during find: {0}
es: Повторите попытку. Ошибка при поиске: {0}
fr: Veuillez réessayer. Erreur lors de la recherche : {0}

# RdlEditPreview_Show_InternalError
source: Internal Error
es: Error interno
fr: Erreur interne

# RdlEditPreview_Show_Report
source: Report
es: Informe
fr: Rapport

# RdlUserControl_Show_PrintError
source: Print error:
es: Ошибка печати:
fr: Erreur d'impression:

# RdlUserControl_Show_PrintOneFile
source: Can only print one file at a time.
es: Solo se puede imprimir un archivo a la vez.
fr: Ne peut imprimer qu'un seul fichier à la fois.

# RdlUserControl_Show_RDLDesign
source: RDL Design
es: Дизайнер отчётов
fr: Conception RDL

# RdlUserControl_Show_ZoomValueInvalid
source: Zoom Value Invalid
es: Некорректное значение масштаба
fr: Valeur de zoom non valide

# ReportCtl_Show_Field_Invalid
source: Field Invalid
es: некорректное поле
fr: Champ non valide

# ReportCtl_Show_SizeInvalid
source: Size value of {0} is invalid.
es: Значение размера {0} некорректно.
fr: La valeur de taille de {0} n'est pas valide.

# StyleBorderCtl_Show_BottomWidth
source: Bottom Width
es: Ширина нижней границы
fr: Largeur inférieure

# StyleBorderCtl_Show_DefaultWidth
source: Default Width
es: Ширина по умолчанию
fr: Largeur par défaut

# StyleBorderCtl_Show_LeftWidth
source: Left Width
es: Ширина левой границы
fr: Largeur gauche

# StyleBorderCtl_Show_RightWidth
source: Right Width
es: Ширина правой границы
fr: Largeur droite

# StyleBorderCtl_Show_SizeInvalid
source: Size Invalid
es: некорректна
fr: Taille invalide

# StyleBorderCtl_Show_TopWidth
source: Top Width
es: Ширина верхней границы
fr: Largeur supérieure

# StyleCtl_Show_Bottom
source: Bottom
es: Abajo
fr: Fond

# StyleCtl_Show_Left
source: Left
es: Izquierda
fr: Gauche

# StyleCtl_Show_PaddingInvalid
source: {0} Padding Invalid
es: {0} некорректный отступ
fr: {0} remplissage non valide

# StyleCtl_Show_Right
source: Right
es: Derecha
fr: Droite

# StyleCtl_Show_Top
source: Top
es: Arriba
fr: Retour au début

# StyleTextCtl_Show_InvalidFontSize
source: Invalid Font Size
es: Некорректный размер шрифта
fr: Taille de police non valide

# SubreportCtl_Show_ErrorReading
source: Error reading report file
es: Ошибка чтения отчёта
fr: Erreur lors de la lecture du fichier de rapport

# SubreportCtl_Show_ReportLoadFailed
source: Report load failed
es: Ошибка загрузки отчёта
fr: Échec du chargement du rapport

# SubreportCtl_Show_Subreport
source: Subreport
es: Subinforme
fr: Sous-état

# SubreportCtl_Show_SubreportMustSpecified
source: Subreport file must be specified.
es: Файл подотчёта должен быть указан
fr: Le fichier de sous-rapport doit être spécifié.

# TableColumnCtl_Show_ExpressionTrueFalse
source: {0} must be an expression or 'true' or 'false'
es: {0} должен быть 'true' или 'false'
fr: {0} doit être une expression « vrai » ou « faux »

# TableColumnCtl_Show_HiddenInvalid
source: Hidden is Invalid
es: Поле "Скрытый" некорректно
fr: Caché n'est pas valide

# TableColumnCtl_Show_WidthInvalid
source: Width is Invalid
es: Ширина некорректна
fr: La largeur n'est pas valide

# TableCtl_Show_Table
source: Table
es: Tabla

# TableCtl_Show_TableMustHaveRegions
source: Table must have at least one Header, Details or Footer row defined.
es: В таблицы должно быть как минимум по одной строке для Заголовка, Тела и Окончания.
fr: La table doit avoir au moins une ligne d'en-tête, de détails ou de pied de page définie.

# TableRowCtl_Show_ExpressionTrueFalse
source: {0} must be an expression or 'true' or 'false'
es: {0} должен быть 'true' или 'false'
fr: {0} doit être une expression « vrai » ou « faux »

# TableRowCtl_Show_HeightInvalid
source: Height is Invalid
es: Высота некорректна
fr: La hauteur n'est pas valide

# TableRowCtl_Show_HiddenInvalid
source: Hidden is Invalid
es: Поле "Скрытый" некорректно
fr: Caché n'est pas valide

# DialogDatabase_cbConnectionTypes_SelectedIndexChanged_Connection
source: Connection:
es: Соединение:
fr: Connexion:

# DialogDatabase_cbConnectionTypes_SelectedIndexChanged_Shared_Data_Source_File
source: Shared Data Source File:
es: Общий источник данных (файл):
fr: Fichier de source de données partagé :

# DialogAbout_DialogAbout_About
source: RDL Designer creates reports defined using the Report Definition Language Specification. Copyright (C) 2004-2008 fyiReporting Software, LLC Copyright (C) 2025 Majorsilence Devs Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. For additional information, visit the website https://github.com/majorsilence/My-FyiReporting.
es: Дизайнер отчётов создает отчеты, определенные с помощью языка определения отчетов (RDL). Copyright (C) 2004-2008 fyiReporting Software, LLC Под лицензией Apache, версии 2.0 (the "License"); Вы не можете использовать этот файл только в соответствии с лицензией. Вы можете получить копию лицензии на http://www.apache.org/licenses/LICENSE-2.0 Если иное не требуется применимым законодательством или согласовано в письменной форме, программное обеспечение распространяется под лицензией "КАК ЕСТЬ", БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА, явных или подразумеваемых. См. Лицензию на других языках, регулирующих разрешения и ограничения в рамках лицензии. Для получения дополнительной информации посетите сайт https://github.com/majorsilence/My-FyiReporting.

# DialogAbout_DialogAbout_Version
source: Version {0}
es: Versión {0}

# PositionCtl_InitValues_GroupSelected
source: Group Selected
es: Групповое выделение
fr: Groupe sélectionné

# RdlDesigner_CreateMDIChild_Untitled
source: Untitled
es: Безымянный

# ReportParameterCtl_bDefaultValues_Click_Default_Values
source: Default Values
es: Valores predeterminados
fr: Valeurs par défaut

# Tabs_Background
source: Background
es: Fondo
fr: Arrière-plan

# Tabs_Borders
source: Borders
es: Границы
fr: Frontières

# Tabs_Code
source: Code
es: Código

# Tabs_Filter
source: Filter
es: Filtro
fr: Filtre

# Tabs_Font
source: Font
es: Fuente
fr: Police

# Tabs_Grouping
source: Grouping
es: Agrupación
fr: Groupement

# Tabs_Image
source: Image
es: Imagen

# Tabs_Interactivity
source: Interactivity
es: Interactividad
fr: Interactivité

# Tabs_ModulesAndClasses
source: Modules and Classes
es: Модули и классы
fr: Modules et cours

# Tabs_ReportParameters
source: Report Parameters
es: Параметры отчёта
fr: Paramètres du rapport

# Tabs_Sorting
source: Sorting
es: Ordenación
fr: Classement

# Tabs_Subreport
source: Subreport
es: Subinforme
fr: Sous-état

# Tabs_Visibility
source: Visibility
es: Visibilidad
fr: Visibilité

# DesignerUtility_Error_NumberFormatinvalid
source: Number format is invalid. ###.## is the proper form.
es: Формат числа некорректен. Должен быть: ###.##
fr: Le format numérique n'est pas valide. ###.## est la forme appropriée.

# DesignerUtility_Error_SizeLessZero
source: Size can't be less than zero.
es: Размер не может быть меньше 0
fr: La taille ne peut pas être inférieure à zéro.

# DesignerUtility_Error_SizeUnitInvalid
source: Size unit is not valid. Must be in, cm, mm, pt, or pc.
es: Единица размера некорректна. Должно быть: in, cm, mm, pt, or pc.
fr: L'unité de taille n'est pas valide. Doit être en, cm, mm, pt ou pc.

# DesignerUtility_Error_SizeZero
source: Size can't be zero.
es: Размер не может быть равен 0
fr: La taille ne peut pas être nulle.

# DesignXmlDraw_Error_DataRegionIntoHeaderFooter
source: You can't paste a DataRegion into a page header or footer
es: Нельзя вставлять регион данных в заголовок или окончание страницы.
fr: Vous ne pouvez pas coller une DataRegion dans un en-tête ou un pied de page

# DesignXmlDraw_Error_NoReport
source: RDL doesn't contain a report element.
es: RDL не содержит элемента "Report".
fr: RDL ne contient pas d'élément de rapport.

# DesignXmlDraw_Error_SubreportIntoHeaderFooter
source: You can't paste a Subreport into a page header or footer
es: Нельзя вставлять подотчёт в заголовок или окончание страницы.
fr: Vous ne pouvez pas coller un sous-rapport dans un en-tête ou un pied de page

# DialogDatabase_Error_UnknownIfdef
source: Unknown ifdef element {0} specified in template.
es: Неизвестный элемент "{0}" указанный в шаблоне.
fr: L'élément ifdef inconnu {0} spécifié dans le modèle.

# DialogToolOptions_Error_RecentFilesMax
source: Recent files maximum must be an integer between 1 and 50
es: Максимальное количество недавних файлов должно быть целым числом от 1 до 50
fr: Les fichiers récents doivent être composés au maximum d'un nombre entier compris entre 1 et 50

# DialogToolOptions_Error_UnableConfig
source: Unable to obtain Desktop config information. {0}
es: Не удалось получить информацию конфигурации рабочего стола. {0}
fr: Impossible d'obtenir les informations de configuration du bureau. {0}

# MDIChild_Error_AllowedExportTypes
source: Only HTML, MHT, XML, CSV, RTF, DOC, Excel, TIF and PDF are allowed as Export types.
es: Для экспорта поддерживаются только следующие форматы: HTML, MHT, XML, CSV, RTF, DOC, Excel, TIF и PDF.
fr: Seuls les formats HTML, MHT, XML, CSV, RTF, DOC, Excel, TIF et PDF sont autorisés en tant que types d'exportation.

# Undo_Error_EndGroupNotMatchStartGroup
source: Internal logic error: EndGroup doesn't match StartGroup
es: Внутренняя логическая ошибка: конец группы не соответствует началу группу
fr: Erreur de logique interne : EndGroup ne correspond pas à StartGroup

# Undo_Error_UnknownAction
source: Unknown Action
es: Acción desconocida
fr: Action inconnue

# BackgroundCtl_bExternal_Click_ImageFilesFilter
source: Bitmap Files (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|All Picture Files|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|All files (*.*)|*.*
es: BMP (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|Все изображения|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|Все файлы (*.*)|*.*

# DataSetRowsCtl_bRowsFile_Click_XMLFilesFilter
source: XML files (*.xml)|*.xml|All files (*.*)|*.*
es: XML (*.xml)|*.xml|Все файлы (*.*)|*.*

# DataSetRowsCtl_bRowsFile_Click_XMLFilesTitle
source: Specify XML File Name
es: Выберите XML-файл
fr: Spécifier le nom du fichier XML

# DialogDatabase_bShared_Click_DSRFilter
source: Data source reference files (*.dsr)|*.dsr|All files (*.*)|*.*
es: Orígenes de datos compartidos (*.dsr)|*.dsr|Todos los archivos (*.*)|*.*
fr: Fichiers de référence de source de données (*.dsr)|*.dsr|Tous les fichiers (*.*)|*.*

# DialogDatabase_bShared_Click_DSRTitle
source: Specify Data Source Reference File Name
es: Выберите общий источник данных
fr: Spécifier le nom du fichier de référence de la source de données

# DialogDatabase_buttonSqliteSelectDatabase_Click_AllFilesFilter
source: All files (*.*)|*.*
es: Все файлы (*.*)|*.*
fr: Tous les fichiers (*.*)|*.*

# DialogDataSources_bGetFilename_Click_DSRFilter
source: Data source reference files (*.dsr)|*.dsr|All files (*.*)|*.*
es: Orígenes de datos compartidos (*.dsr)|*.dsr|Todos los archivos (*.*)|*.*
fr: Fichiers de référence de source de données (*.dsr)|*.dsr|Tous les fichiers (*.*)|*.*

# DialogDataSources_bGetFilename_Click_DSRTitle
source: Specify Data Source Reference File Name
es: Выберите общий источник данных
fr: Spécifier le nom du fichier de référence de la source de données

# DialogEmbeddedImages_bImport_Click_ImageFilesFilter
source: Bitmap Files (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|All Picture Files|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|All files (*.*)|*.*
es: BMP (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|Все изображения|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|Все файлы (*.*)|*.*
fr: Fichiers bitmap (*.bmp)|*.bmp|JPEG (*.jpg ;*.jpeg ;*.jpe ;*.jfif)|*.jpg ;*.jpeg ;*.jpe ;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif ;*.tiff)|*.tif ;*.tiff|PNG (*.png)|*.png|Tous les fichiers image|*.bmp ;*.jpg ;*.jpeg ;*.jpe ;*.jfif ;*.gif ;*.tif ;*.tiff ;*.png|Tous les fichiers (*.*)|*.*

# DialogToolOptions_bAddMap_Click_MapFilesFilter
source: Map files (*.xml)|*.xml|All files (*.*)|*.*
es: Mapas (*.xml)|*.xml|Todos los archivos (*.*)|*.*
fr: Fichiers de mappage (*.xml)|*.xml|Tous les fichiers (*.*)|*.*

# DrillParametersDialog_bFile_Click_ReportFilesFilter
source: Report files (*.rdl)|*.rdl|All files (*.*)|*.*
es: Informes (*.rdl)|*.rdl|Todos los archivos (*.*)|*.*
fr: Fichiers de rapport (*.rdl)|*.rdl|Tous les fichiers (*.*)|*.*

# DrillParametersDialog_bFile_Click_ReportFilesTitle
source: Specify Report File Name
es: Seleccionar informe
fr: Spécifier le nom du fichier de rapport

# FileUIEditor_EditValue_XSLFilesFilter
source: XSL Files (*.xsl)|*.xsl|All files (*.*)|*.*
es: XSL (*.xsl)|*.xsl|Все файлы (*.*)|*.*
fr: Fichiers XSL (*.xsl)|*.xsl|Tous les fichiers (*.*)|*.*

# ImageCtl_bExternal_Click_ImageFilesFilter
source: Bitmap Files (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|All Picture Files|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|All files (*.*)|*.*
es: BMP (*.bmp)|*.bmp|JPEG (*.jpg;*.jpeg;*.jpe;*.jfif)|*.jpg;*.jpeg;*.jpe;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif;*.tiff)|*.tif;*.tiff|PNG (*.png)|*.png|Все изображения|*.bmp;*.jpg;*.jpeg;*.jpe;*.jfif;*.gif;*.tif;*.tiff;*.png|Все файлы (*.*)|*.*
fr: Fichiers bitmap (*.bmp)|*.bmp|JPEG (*.jpg ;*.jpeg ;*.jpe ;*.jfif)|*.jpg ;*.jpeg ;*.jpe ;*.jfif|GIF (*.gif)|*.gif|TIFF (*.tif ;*.tiff)|*.tif ;*.tiff|PNG (*.png)|*.png|Tous les fichiers image|*.bmp ;*.jpg ;*.jpeg ;*.jpe ;*.jfif ;*.gif ;*.tif ;*.tiff ;*.png|Tous les fichiers (*.*)|*.*

# InteractivityCtl_bDrillthrough_Click_ReportFilesFilter
source: Report files (*.rdl)|*.rdl|All files (*.*)|*.*
es: Informes (*.rdl)|*.rdl|Todos los archivos (*.*)|*.*
fr: Fichiers de rapport (*.rdl)|*.rdl|Tous les fichiers (*.*)|*.*

# InteractivityCtl_bDrillthrough_Click_ReportFilesTitle
source: Specify Report File Name
es: Seleccionar informe
fr: Spécifier le nom du fichier de rapport

# RdlDesigner_menuFileOpen_Click_ReportFilesFilter
source: Report files (*.rdl;*rdlc)|*.rdl;*.rdlc|Encrypted RDL files (*.encrypted)|*.encrypted|All files (*.*)|*.*
es: Отчёты (*.rdl;*rdlc)|*.rdl;*.rdlc|Все файлы (*.*)|*.*
fr: Fichiers de rapport (*.rdl ;*rdlc)|*.rdl ;*.rdlc|Fichiers RDL cryptés (*.encrypted)|*.encrypted|Tous les fichiers (*.*)|*.*

# RdlUserControl_openToolStripButton1_Click_ReportFilesFilter
source: Report files (*.rdl;*rdlc)|*.rdl;*.rdlc|All files (*.*)|*.*
es: Отчёты (*.rdl;*rdlc)|*.rdl;*.rdlc|Все файлы (*.*)|*.*
fr: Fichiers de rapport (*.rdl ;*rdlc)|*.rdl ;*.rdlc|Tous les fichiers (*.*)|*.*

# ReportXmlCtl_bOpenXsl_Click_XslFilerTitle
source: Specify DataTransform File Name
es: Выберите файл преобразования данных
fr: Spécifier le nom du fichier DataTransform

# ReportXmlCtl_bOpenXsl_Click_XSLFilesFilter
source: XSL files (*.xsl)|*.xsl|All files (*.*)|*.*
es: XSL (*.xsl)|*.xsl|Все файлы (*.*)|*.*
fr: Fichiers XSL (*.xsl)|*.xsl|Tous les fichiers (*.*)|*.*

# SubreportCtl_bFile_Click_ReportFilesFilter
source: Report files (*.rdl)|*.rdl|All files (*.*)|*.*
es: Отчёты (*.rdl)|*.rdl| зашифрованный (*.encrypted)|*.encrypted|Все файлы (*.*)|*.*
fr: Fichiers de rapport (*.rdl)|*.rdl|Tous les fichiers (*.*)|*.*

# SubreportCtl_bFile_Click_ReportFilesTitle
source: Specify Report File Name
es: Seleccionar informe
fr: Spécifier le nom du fichier de rapport

# DialogDataSourceRef_bGetFilename_Click_DSRFilter
source: Data source reference files (*.dsr)|*.dsr|All files (*.*)|*.*
es: Orígenes de datos compartidos (*.dsr)|*.dsr|Todos los archivos (*.*)|*.*
fr: Fichiers de référence de source de données (*.dsr)|*.dsr|Tous les fichiers (*.*)|*.*

# DialogDataSourceRef_bGetFilename_Click_DSRTitle
source: Specify Data Source Reference File Name
es: Укажите название общего источника данных
fr: Spécifier le nom du fichier de référence de la source de données

# MDIChild_Export_CSV
source: CSV file (*.csv)|*.csv|All files (*.*)|*.*
es: CSV (*.csv)|*.csv|Все файлы (*.*)|*.*
fr: Fichier CSV (*.csv)|*.csv|Tous les fichiers (*.*)|*.*

# MDIChild_Export_DOC
source: DOC file (*.doc)|*.doc|All files (*.*)|*.*
es: DOC (*.doc)|*.doc|Все файлы (*.*)|*.*
fr: Fichier DOC (*.doc)|*.doc|Tous les fichiers (*.*)|*.*

# MDIChild_Export_Excel
source: Excel file (*.xlsx)|*.xlsx|All files (*.*)|*.*
es: Excel (*.xlsx)|*.xlsx|Все файлы (*.*)|*.*
fr: Fichier Excel (*.xlsx)|*.xlsx|Tous les fichiers (*.*)|*.*

# MDIChild_Export_ExportTitleFormat
source: Export to {0}
es: Экспортировать в {0}
fr: Exporter vers {0}

# MDIChild_Export_MHT
source: MHT (*.mht)|*.mhtml;*.mht|All files (*.*)|*.*
es: MHT (*.mht)|*.mhtml;*.mht|Все файлы (*.*)|*.*
fr: MHT (*.mht)|*.mhtml ;*.mht|Tous les fichiers (*.*)|*.*

# MDIChild_Export_PDF
source: PDF file (*.pdf)|*.pdf|All files (*.*)|*.*
es: PDF (*.pdf)|*.pdf|Все файлы (*.*)|*.*
fr: Fichier PDF (*.pdf)|*.pdf|Tous les fichiers (*.*)|*.*

# MDIChild_Export_RTF
source: RTF file (*.rtf)|*.rtf|All files (*.*)|*.*
es: RTF (*.rtf)|*.rtf|Все файлы (*.*)|*.*
fr: Fichier RTF (*.rtf)|*.rtf|Tous les fichiers (*.*)|*.*

# MDIChild_Export_TIF
source: TIF file (*.tif, *.tiff)|*.tiff;*.tif|All files (*.*)|*.*
es: TIF (*.tif, *.tiff)|*.tiff;*.tif|Все файлы (*.*)|*.*
fr: Fichier TIF (*.tif, *.tiff)|*.tiff ;*.tif|Tous les fichiers (*.*)|*.*

# MDIChild_Export_Web_Page
source: Web Page (*.html, *.htm)|*.html;*.htm|All files (*.*)|*.*
es: Веб-страница (*.html, *.htm)|*.html;*.htm|Все файлы (*.*)|*.*
fr: Page Web (*.html, *.htm)|*.html ;*.htm|Tous les fichiers (*.*)|*.*

# MDIChild_Export_XML
source: XML file (*.xml)|*.xml|All files (*.*)|*.*
es: XML (*.xml)|*.xml|Все файлы (*.*)|*.*
fr: Fichier XML (*.xml)|*.xml|Tous les fichiers (*.*)|*.*

# MDIChild_FileSaveAs_RDLFilter
source: RDL files (*.rdl)|*.rdl|Encrypted RDL files (*.encrypted)|*.encrypted|All files (*.*)|*.*
es: Informes (*.rdl)|*.rdl|Todos los archivos (*.*)|*.*
fr: Fichiers RDL (*.rdl)|*.rdl|Fichiers RDL cryptés (*.encrypted)|*.encrypted|Tous les fichiers (*.*)|*.*

# DesignerUtility_Show_Error
source: Error
fr: Erreur

# DialogDatabase_ShowD_Error
source: Error
fr: Erreur

# PropertyDialog_BuildReportItemTabs_Properties
source: Properties
fr: Propriétés

# RdlDesigner_ShowD_Error
source: Error
fr: Erreur

# ReportNames_DescriptionDuplicateNameError
source: NameError: duplicate name: {0}, name of the node: {1}
fr: NameError : nom du duplicata : {0}, nom du nœud : {1}
