Repository: majorsilence/My-FyiReporting
Catalog: RdlViewer/Resources/Strings.*.resx
Languages: es

# DialogWait_Minutes
source: Minutes
es: минут

# DialogWait_Seconds
source: Seconds
es: секунд

# PageDrawing_OnMouseDown_HyperLinkError
source: HyperLink Error
es: Не правильная гиперссылка

# PageDrawing_OnMouseDown_UnableLink
source: Unable to link to
es: Не удаётся перейти по ссылке

# RdlViewerFind_ErrorA_PropertyMustSetPriorFindNext
source: Viewer property must be set prior to issuing FindNext.
es: La propiedad Viewer debe establecerse antes de comenzar la búsqueda.

# RdlViewerFind_ErrorA_PropertyMustSetPriorFindPrevious
source: Viewer property must be set prior to issuing FindPrevious.
es: La propiedad Viewer debe establecerse antes de comenzar la búsqueda.

# RdlViewerFind_FindNext_Phrase_not_found
source: Phrase not found
es: Фраза не найдена

# RdlViewerFind_FindNext_Reached_end_of_report
source: Reached end of report, continued from top
es: Достигнут конец отчета, продолжаем сначала.

# RdlViewerFind_FindPrevious_Reached_top_of_report
source: Reached top of report, continued from end
es: Достигнуто начало отчёта, продолжаем с конца.

# RdlViewer_Error_Report_must_be_loaded_prior_to_Rebuild_being_called
source: Report must be loaded prior to Rebuild being called.
es: Отчёт должен быть загружен прежде чем пытаться его перестроить.

# RdlViewer_Error_UnsupportedExtension
source: Unsupported file extension for SaveAs
es: Неподдерживаемое разрешение

# RdlViewer_menuFileSaveAs_Click_FilesFilter
source: PDF files (*.pdf)|*.pdf|XML files (*.xml)|*.xml|HTML files (*.html)|*.html|CSV files (*.csv)|*.csv|RTF files (*.rtf)|*.rtf|TIF files (*.tif)|*.tif|Excel 2007 Table Only (*.xlsx)|*.xlsx|Excel 2007 (*.xlsx)|*.xlsx|MHT files (*.mht)|*.mht
es: PDF (*.pdf)|*.pdf|XML (*.xml)|*.xml|HTML (*.html)|*.html|CSV files (*.csv)|*.csv|RTF (*.rtf)|*.rtf|TIF (*.tif)|*.tif|Excel 2007 только таблица (*.xlsx)|*.xlsx|Excel 2007 (*.xlsx)|*.xlsx|MHT (*.mht)|*.mht

# RdlViewer_ParametersLeave_InvalidReportParameter
source: Invalid Report Parameter
es: Некорректный параметр отчёта

# RdlViewer_ParametersViewClick_ReportParameterMissing
source: Report Parameter Missing
es: Отсутствует параметр отчёта

# RdlViewer_ParametersViewClick_RequiredParameterNotProvided
source: Parameter '{0}' is required but not provided.
es: Параметр '{0}' обязателен, но не указан
